==============================
x' = 1
===============================

x' = 1

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (number)))


==============================
foo x y = bar (x, 42, "string", True, False) [y]
===============================

foo x y = bar (x, 42, "string", True, False) [y]

---

(source_file
  (declaration
    lhs: (identifier)
    arg: (identifier)
    arg: (identifier)
    rhs: (application
      (identifier)
      (tupleExpr
        (identifier)
        (number)
        (string)
        (true)
        (false))
      (listExpr
        (identifier)))))


==============================
record definition
===============================

x = { name = "Alice", age = 42 }

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (recordExpr
      (recordExprEntry
        (identifier)
        (string))
      (recordExprEntry
        (identifier)
        (number)))))

===============================
foo = bar . baz
===============================

foo = bar . baz

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (composition
      (identifier)
      (identifier))))


===============================
foo = map (f . f)
===============================

foo = map (f . f)

---

(source_file
  (declaration
    (identifier)
    (application
      (identifier)
      (composition
        (identifier)
        (identifier)))))


==============================
foo x y = (bar x . baz y) 42
===============================

foo x y = (bar x . baz y) 42

---

(source_file
  (declaration
    lhs: (identifier)
    arg: (identifier)
    arg: (identifier)
    rhs: (application
      (composition
        (application
          (identifier)
          (identifier))
        (application
          (identifier)
          (identifier)))
      (number))))

==============================
foo = map (\x -> bar x)
===============================

foo = map (\x -> bar x)

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (application
      (identifier)
      (lambdaExpr
        (identifier)
        (application
          (identifier)
          (identifier))))))


==============================
multiple statements
===============================

x = 1
x = 2

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (number))
  (declaration
    lhs: (identifier)
    rhs: (number)))


==============================
nested wheres
===============================

x = 1
x = y where
    y = z where
        z = w where
            w = 1
    g = 4

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (number))
  (declaration
    lhs: (identifier)
    rhs: (identifier)
    where: (block
      (declaration
        lhs: (identifier)
        rhs: (identifier)
        where: (block
          (declaration
            lhs: (identifier)
            rhs: (identifier)
            where: (block
              (declaration
                lhs: (identifier)
                rhs: (number))))))
      (declaration
        lhs: (identifier)
        rhs: (number)))))


==============================
where spacing
===============================

x = 1
x = y where
    y = z

    z = w
---

(source_file
  (declaration
    (identifier)
    (number))
  (declaration
    (identifier)
    (identifier)
    (block
      (declaration
        (identifier)
        (identifier))
      (declaration
        (identifier)
        (identifier)))))

==============================
where spacing (non-zero blank)
===============================

x = 1    
x = y    where      
       
    y = z 
  
    z =    w
---

(source_file
  (declaration
    (identifier)
    (number))
  (declaration
    (identifier)
    (identifier)
    (block
      (declaration
        (identifier)
        (identifier))
      (declaration
        (identifier)
        (identifier)))))

==============================
nested wheres (spacing)
===============================

x = 1
x = y where

    y = z where
  
        z = w where
                          
            w = 1
    g = 4

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (number))
  (declaration
    lhs: (identifier)
    rhs: (identifier)
    where: (block
      (declaration
        lhs: (identifier)
        rhs: (identifier)
        where: (block
          (declaration
            lhs: (identifier)
            rhs: (identifier)
            where: (block
              (declaration
                lhs: (identifier)
                rhs: (number))))))
      (declaration
        lhs: (identifier)
        rhs: (number)))))
