==============================
x = 1
===============================

x = 1

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (number)))


==============================
foo x y = bar (x, 42, "string", True, False) [y]
===============================

foo x y = bar (x, 42, "string", True, False) [y]

---

(source_file
  (declaration
    lhs: (identifier)
    arg: (identifier)
    arg: (identifier)
    rhs: (application
      term: (identifier)
      (tupleExpr
        term: (identifier)
        (number)
        (string)
        (true)
        (false))
      (listExpr
        term: (identifier)))))


==============================
record definition
===============================

x = { name = "Alice", age = 42 }

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (recordExpr
      (recordExprEntry
        (identifier)
        (string))
      (recordExprEntry
        (identifier)
        (number)))))

==============================
foo = bar . baz
===============================

foo = bar . baz

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (composition
      term: (identifier)
      term: (identifier))))


==============================
foo x y = (bar x . baz y) 42
===============================

foo x y = (bar x . baz y) 42

---

(source_file
  (declaration
    lhs: (identifier)
    arg: (identifier)
    arg: (identifier)
    rhs: (application
      (composition
        (application
          term: (identifier)
          term: (identifier))
        (application
          term: (identifier)
          term: (identifier)))
      (number))))

==============================
foo = map (\x -> bar x)
===============================

foo = map (\x -> bar x)

---

stub

==============================
multiple statements
===============================

x = 1
x = 2

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (number))
  (declaration
    lhs: (identifier)
    rhs: (number)))


==============================
nested wheres
===============================

x = 1
x = y where
    y = z where
        z = w where
            w = 1
    g = 4

---

(source_file
  (declaration
    lhs: (identifier)
    rhs: (number))
  (declaration
    lhs: (identifier)
    term: (identifier)
    where: (block
      (declaration
        lhs: (identifier)
        term: (identifier)
        where: (block
          (declaration
            lhs: (identifier)
            term: (identifier)
            where: (block
              (declaration
                lhs: (identifier)
                rhs: (number))))))
      (declaration
        lhs: (identifier)
        rhs: (number)))))

