==============================
no imported values
===============================

import foo ()

---

(source_file
  (import
    moduleName: (identifier)))


===============================
universal import
===============================

import foo

---

(source_file
  (import
    moduleName: (identifier)))


===============================
specific values
===============================

import foo (a, b as c)

---

(source_file
  (import
    moduleName: (identifier)
    (importTerm
      term: (identifier))
    (importTerm
      term: (identifier)
      alias: (identifier))))

===============================
specific types
===============================

import foo (Int, x)

---

(source_file
  (import
    moduleName: (identifier)
    (importTerm
      type: (identifierU))
    (importTerm
      term: (identifier))))
